
# الإعداد الأولي (مرة واحدة فقط)
# من أنت GitHub قبل أن ترفع، يجب أن يعرف
# git config --global user.name "sulaiman"
# git config --global user.email "s1j2b1@gmail.com"

# أنشئ نيو هستري على الجت هب بيعطيك هذلا الكودات لربط الجت هب مع التيرمنل

# اذا كان الهستري ما يزال فارغ
# …or create a new repository on the command line

# اذا رفعت ملفات على هذا الهستري قبل
# …or push an existing repository from the command line


# -----------------------------
# هذه هي "الخطة" التي ستكررها كلما أجريت تعديلاً:

# قبل أن ترفع أي شيء ليظهر قائمة بالملفات التي عدلتها ولم ترفعها بعد
# git status.

# التجهيز (Stage):
# git add .

# التثبيت (Commit): سجل التعديلات مع وصف (رسالة)
# git commit -m "تحديث واجهة لوحة التحكم وتحسين خوارزمية التنبؤ"

# الرفع اول مرة (Push):
# git push -u origin main
# المرات القادمة فقط تحديث
# git push


# --------------------------- ملاحظات ---------------------------
# لرفع ملف محدد:
# git add file1 name.py file2 name.py


# لرفع كل الملفات (عدا المستثناة): النقطة تعني كل شيء في هذا المجلد
# git add .


# كيف تستثني ملفات لا تريد رفعها؟ (ملفات خاصة!)
# .gitignore أنشئ ملفاً في مجلد المشروع اسمه 







